/*
(i) Код попадает в итоговый файл,
только когда вызвана функция,
например flsFunctions.spollers();
Или когда импортирован весь файл,
например import "files/script.js";
Неиспользуемый (не вызванный)
код в итоговый файл не попадает.

Если мы хотим добавить модуль
следует его расскоментировать
*/

// Включить/выключить ART (Full Logging System) (в работе)
window['ART'] = false;

// Подключение основного файла стилей
import "../scss/style.scss";

// ========================================================================================================================================================================================================================================================
// Функционал ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================
import * as flsFunctions from "./files/functions.js";

/* Проверка поддержки webp, добавление класса webp или no-webp для HTML */
/* (i) необходимо для корректного отображения webp с css */
flsFunctions.isWebp();
/* Добавление класса touch для HTML если браузер мобильный */
flsFunctions.addTouchClass();
/* Добавление loaded для HTML после полной загрузки страницы */
//flsFunctions.addLoadedClass();

/* Модуль для работы с меню (Бургер) */
// flsFunctions.menuInit();
/* Учет плавающей панели на мобильных устройствах при 100vh */
// flsFunctions.fullVHfix();


// ========================================================================================================================================================================================================================================================
// Работа по формами ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================
import * as flsForms from "./files/forms/forms.js";

/* Динамический адаптив */
// Документация: https://template.fls.guru/template-docs/dinamicheskij-adaptiv.html
// import "./libs/dynamic_adapt.js";

// Ленивая (отложенная) загрузка картинок
// Документація плагіна: https://github.com/verlok/vanilla-lazyload
// Сниппет(HTML): imgl
// import './files/scroll/lazyload.js';


// Наблюдатель за объектами с атрибутом data-watch
// Документация: https://template.fls.guru/template-docs/modul-nabljudatel-za-poyavleniem-elementa-pri-skrolle.html
// Сниппет(HTML):
// import './libs/watcher.js'

// Функции работы скролом
import * as flsScroll from "./files/scroll/scroll.js";

// Плавная навигация по странице
// Документация:
// flsScroll.pageNavigation();

// Функционал добавления классов к хедеру во время прокрутки
// Документация:
// flsScroll.headerScroll();

/*
Модуль "Кастомний курсор"
Документация:
Сниппет (HTML):
*/
// flsFunctions.customCursor(true);

// ========================================================================================================================================================================================================================================================

// Прочее ========================================================================================================================================================================================================================================================
/*
Модуль "Filter Gallery"
 Документация:
 Сниппетт (HTML): filter
	<ul class="filter">
		<li class="filter__list">
			<button class="filter__button active" data-filter="all" type="button">All</button>
		</li>
	</ul>
	<div class="product">
		<div class="product__box" data-item="all"></div>
	</div>
*/
// flsFunctions.filterGallery();

// Отправка формы на почту Библиотека
// Документація: https://www.emailjs.com/
// Сніппет(HTML):
// import './libs/emaillibs.js'

/*
Модуль "EMAIL JS"
Документация: https://www.emailjs.com/
Сниппет (HTML):
*/
// flsFunctions.libsForSendingFormsEmail();



// ========================================================================================================================================================================================================================================================

/* Подключаем файлы со своим кодом */
import "./files/script.js";
//============================================================================================================================================================================================================================================